# Завдання 1 
# Заповнити новий пустий список 'filtered_list' словами що посинаються на літеру "f".

#--------------------------------------------------------------------

# Початковий список з рядками

original_list = ["apple", "banana", "cherry", "date", "elderberry", "fig"]

# Створення нового списку з використанням циклу for
filtered_list = []

for word in original_list:
    if word.startswith("f"):
        filtered_list.append(word)

# Виведення нового списку
print(filtered_list)

#--------------------------------------------------------------------
#Завдання 2
#Для того щоб точніше рахувати секунди використовують секунди Місісіпі. Ми хочемо щоб програма порахувала 10 секунд і кожну сукунду виводила наш лічильник
from datetime import time
# Початкове значення лічильника
counter = 0

# Максимальне значення, до якого ми хочемо дійти
max_value = 10

# Цикл while, який збільшує лічильник
while counter < max_value:
    time.sleep(1)
    print(f"{counter} Місісіпі")
    counter += 1

print("Цикл завершено.")

#Завдання 3
#Давайте створимо список, який містить перші 10 чисел Фібоначчі. Послідовність Фібоначчі – це ряд чисел, 
# в якій кожне число є сумою двох попередніх. Спочатку ми визначаємо перші два числа Фібоначчі (0 і 1), 
# а потім за допомогою генератора списку обчислюємо наступні числа Фібоначчі, 
# використовуючи попередні два. Результатом є список, який містить перші 10 чисел Фібоначчі: 
# [0, 1, 1, 2, 3, 5, 8, 13, 21, 34].

#--------------------------------------------------------------------

fibonacci = [0, 1]
for i in range(2, 10):
    fibonacci.append(fibonacci[i - 1] + fibonacci[i - 2])

# Виведення списку чисел Фібоначчі
print(fibonacci)

#--------------------------------------------------------------------

#Вирішення питання минулого уроку(потрібно замість спроби виведення всього двувимірного списку виводити 
#тільки рядок, створений за допомогою вкладеного циклу`for`)

list1 = []

for i in range(10):
    row = []
    for ii in range(10):
        row.append(ii**3)
    list1.append(row)
    print(i, row)

#print(list1)