#Виконайте форматування виведення списку чисел Фібоначчі за допомогою f-рядку

fibonacci = [0, 1]
for i in range(2, 10):
    fibonacci.append(fibonacci[i - 1] + fibonacci[i - 2])

# Виведення списку чисел Фібоначчі
print(fibonacci)

#Виконайте форматований вивід матриці за допомогою f-рядка та потрійних лапок за потреби.
#Вирішення питання минулого уроку(потрібно замість спроби виведення всього двувимірного списку виводити 
#тільки рядок, створений за допомогою вкладеного циклу`for`)

list1 = []

for i in range(10):
    row = []
    for ii in range(10):
        row.append(ii**3)
    list1.append(row)
    print(i, row)

#print(list1)

#Виконайте форматований вивід за допомогою f-рядка

hat_list = [1, 2, 3, 4, 5]  # This is an existing list of numbers hidden in the hat.

# Step 1: write a line of code that prompts the user
# to replace the middle number with an integer number entered by the user.
user_nunber = (int(input("Enter an ineger to replace the middle number: ")))
hat_list[int(len(hat_list)//2)] = user_nunber
print(hat_list)
# Step 2: write a line of code that removes the last element from the list.
del hat_list[-1]
print(hat_list)
# Step 3: write a line of code that prints the length of the existing list.
print(len(hat_list))

# Виконайте форматування зворотнього сортування 
my_list = [1, 7, 23, 34, 0]
my_list.sort()
print(my_list)
my_list.reverse()
print(my_list)


#Калькулятор оплати праці:
#Створіть програму, яка приймає введені користувачем дані про години роботи
#і ставку за годину. Виведіть рядок, який містить інформацію про заробітну 
#плату користувача. 
#--------------------------------------------------------------------------
#Введіть кількість годин: 40
#Введіть ставку за годину: 25
#Ваша зарплата за тиждень складає $1000.


#Калькулятор BMI:
#Напишіть програму для обчислення Індексу маси тіла (BMI) користувача. Програма 
#має запитувати вагу (у кілограмах) та зріст (у метрах), а потім обчислювати та 
#виводити значення BMI. Для розрахунку Індексу маси тіла необхідно поділити вагу(кг) на квадрат зросту(м)(тобто зріст пудноситься до степеню 2).Наприклад:
#--------------------------------------------------------------------------
#Введіть вашу вагу у кг: 70
#Введіть ваш зріст у м: 1.75
#Ваш BMI: 22.86


#Генератор імен користувачів:
#Напишіть програму для створення електронних імен користувачів на основі їхнього 
#імені та року народження. Програма має приймати введені користувачем дані та 
#генерувати ім'я користувача з електронною поштою. Наприклад:
#--------------------------------------------------------------------------
#Введіть своє ім'я: John
#Введіть рік вашого народження: 1990
#Електронне ім'я користувача: john1990@example.com
