# Використаємо умовний оператор if-else для перевірки чи наявний a елемент у списку my_list.
my_list = [316, 413, 374, 124, 474, 295, 69, 172, 500, 198, 170, 318]
my_list1 = [350, 308, 44, 443, 500, 409, 54, 328, 20, 316, 413, 374, 124, 474, 295, 69, 172, 500, 198, 170, 318, 449, 119, 435, 179, 429, 113, 453, 420, 80, 292, 322, 143]
a = 124
# перевіряємо ци є елемент "a" в списку "my_list". якщо так, виводимо повідомлення про це
# інакше якщо "a" в списку "my_list1" виводимо повідомлення про це
# інакше, якщо елемента "а" немає в жодному списку виводимо відповідне повідомлення.