# Завдання 1
# Потрібно модернізувати код програми таким чином
# щоб на екран виводився результат у вигляді цілого числа

num1 = 5040
num2 = 10

# Обчислення суми
sum_result = num1 + num2
print(f"Сума: {sum_result}")

# Обчислення різниці
difference_result = num1 - num2
print(f"Різниця: {difference_result}")

# Обчислення добутку
multiply_result = num1 * num2
print(f"Добуток: {multiply_result}")

division_result = num1 / num2
print(f"Добуток: {division_result}")

# Завдання 2
# Потрібно додати до початкового списку елемент '6'(в кінець списку),
# на друге місце в списку додати елемент 42


# Створення початкового списку
my_list = [1, 2, 3, 4, 5]

# Виведення початкового списку на екран
print("Початковий список:", my_list)

# Додавання нового елементу до списку

print("Список після додавання елементу:", my_list)

# Додавання елементу '42' на позицію 2

print("Список після додавання елементу на позицію 2:", my_list)

# Видалення елементу за індексом 1

print("Список після видалення елементу за індексом 1:", my_list)

# Видалення елементу за значенням 42

print("Список після видалення елементу за значенням 42:", my_list)
# Завдання 3
# Потрібно доповнити код щоб знайти центральний елемент списку і вивести
# його на екран. Для зручності можна створити додаткову змінну.

random_numbers = [350, 308, 44, 443, 500, 409, 54, 328, 20, 316, 413, 374, 124, 474, 295, 69, 172, 500, 198, 170, 318, 449, 119, 435, 179, 429, 113, 453, 420, 80, 292, 322, 143]
central_number =
print("Центральний елемент:", central_number)
