# Приклад іменування змінних що мають містити ім'я, прізвище, вік,
# зріст і вагу (Формат виведення даних розглянемо на наступних уроках).
# Мета: навчитися давати змінним осмислені імена, які будуть
# зрозумілі як вам через тиждень/місяць/рік після написання коду, так і
# людині, якій можливо потрібно буде працювати із даним кодом.

first_name = "Alex"
last_name = "Smith"
age = 25
height_cm = 180
weight = 70

print(f"""Медична картка {first_name} {last_name}
Вік: {age};
Зріст(см): {height_cm};
Вага(кг): {weight}.""")

# Завдання 1
# Створити змінні що будуть містити ім'я, адресу проживання та контактну
# інформацію про клієнта організації. Тестові дані: Іван Мельник, проживає
# за адресою вул. Шевченка 123, має електронну адресу Ivan123@example.com,
# номер телевону +380999999999. Вивести дані на екран у довільному вигляді.


# Завдання 2
# Створити змінні що будуть містити інформацію про книгу: назва книги,
# автор, рік видання, тираж, кількість сторінок. Тестові дані: Пригоди
# Аліси в країні Чудес, тираж - 2000, автор - Л'юіс Керрол, 1865 рік,
# 160 сторінок.



# Завдання 3
# Створити змінні що будуть описувати поля в телефонній книзі: Ім'я,
# Прізвище, Номери телефонів(Номер може бути як один так і більше, також має
# бути присутня можливість змінити номер телефону програмно(наприклад, додати
# або видалити номер) без виникнення помилок). Тестові дані: Мама, відсутні
# дані(позначаються None), 380999999999, 380977777777